Para praticar os métodos aprendidos no decorrer dessa aula e também aprender novos, vamos realizar algumas análises utilizando um arquivo csv diferente: alunos.csv.

1) Importe o arquivo alunos.csv e armazene seu conteúdo em um DataFrame Pandas.

2) Visualize as primeiras 7 linhas do DataFrame e as 5 últimas.

3) Confira a quantidade de linhas e colunas desse DataFrame.

4) Explore as colunas do DataFrame e analise os tipos dos dados presentes em cada coluna.

Extra: Calcule algumas estatísticas descritivas básicas dos dados do DataFrame (média, desvio padrão, etc). Dica: pesquise pelo método describe.

In [2]:
alumnos = 'https://raw.githubusercontent.com/alura-cursos/pandas-conhecendo-a-biblioteca/main/desafios/alunos.csv'

In [3]:
import pandas as pd

df = pd.read_csv(alumnos, sep=',')
df.head(7)

    Nome  Idade  Notas  Aprovado
0    Ary     20    7.5      True
1    Ana     18    NaN     False
2  Cátia     27    2.5     False
3  Denis     18    5.0     False
4   Beto     21   10.0      True
5  Bruna     23    NaN     False
6   Dara     21    7.0      True

In [4]:
df.tail(5)

      Nome  Idade  Notas  Aprovado
13   Mirla     25    9.0      True
14   Paulo     37    NaN     False
15  Mylena     29    7.0      True
16   Lucas     33    NaN     False
17   Nadia     34    8.0      True

In [5]:
df.shape

(18, 4)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nome      18 non-null     object
 1   Idade     18 non-null     int64
 2   Notas     12 non-null     float64
 3   Aprovado  18 non-null     bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 582.0+ bytes

In [7]:
df.describe().round(2)

       Idade  Notas
count  18.00  12.00
mean   25.50   6.80
std     6.07   2.20
min    18.00   2.50
25%    21.00   5.45
50%    24.50   7.00
75%    28.75   8.25
max    37.00  10.00

## Practicando groupby

In [8]:
df = pd.DataFrame({
   'Animal': ['Cachorro', 'Gato', 'Elefante', 'Cachorro', 'Gato', 'Elefante'],
   'Cor': ['Preto', 'Branco', 'Cinza', 'Marrom', 'Preto', 'Marrom'],
   'Quantidade': [2, 3, 1, 4, 2, 2]
})
df

     Animal     Cor  Quantidade
0  Cachorro   Preto           2
1      Gato  Branco           3
2  Elefante   Cinza           1
3  Cachorro  Marrom           4
4      Gato   Preto           2
5  Elefante  Marrom           2

In [9]:
df.groupby('Animal')[['Quantidade']].sum()

          Quantidade
Animal
Cachorro           6
Elefante           3
Gato               5

In [10]:
df.groupby(['Animal','Cor'])[['Quantidade']].sum()

                 Quantidade
Animal   Cor
Cachorro Marrom           4
         Preto            2
Elefante Cinza            1
         Marrom           2
Gato     Branco           3
         Preto            2

Para saber mais: alterando os nomes de colunas
 
 Próxima Atividade

Quando trabalhamos com bases de dados, em alguns momentos, pode ser necessário fazermos alterações nos nomes das colunas. Por exemplo, quando criamos o seguinte DataFrame no nosso projeto:

In [11]:
df

     Animal     Cor  Quantidade
0  Cachorro   Preto           2
1      Gato  Branco           3
2  Elefante   Cinza           1
3  Cachorro  Marrom           4
4      Gato   Preto           2
5  Elefante  Marrom           2

Y quieramos cambiar el nombre de la columna Quantidade por Qtd. Podemos usar el metodo rename() y ademas usaremos el parametro inplace=True para que los cambios sean definitvos.

In [12]:
#Primero realizamos una copia
df_ejemplo = df.copy()
#Luego aplicamos los cambios sobre la copia
df_ejemplo.rename(columns={"Quantidade":"Qtd."}, inplace=True)
#Podemos ver el nuevo nombre de la columna
df

     Animal     Cor  Quantidade
0  Cachorro   Preto           2
1      Gato  Branco           3
2  Elefante   Cinza           1
3  Cachorro  Marrom           4
4      Gato   Preto           2
5  Elefante  Marrom           2

### Desafio: bora praticar?
 Próxima Atividade

O time de ML chegou com algumas demandas de última hora para resolvermos nesse momento da análise exploratória. Essas demandas são:

1) Calcular a média de quartos por apartamento;

In [13]:
url ='https://raw.githubusercontent.com/alura-cursos/pandas-conhecendo-a-biblioteca/main/base-de-dados/aluguel.csv'

In [14]:
df_inmobiliaria = pd.read_csv(url, sep=';')
tipo_apartamento = df_inmobiliaria.query("'Apartamento' in Tipo")
tipo_apartamento["Quartos"].mean()

np.float64(2.481568707761622)


2) Conferir quantos bairros únicos existem na nossa base de dados;

In [15]:
df_inmobiliaria.Bairro.value_counts().to_frame().query('count < 2').count()

count    9
dtype: int64


3) Analisar quais bairros possuem a média de valor de aluguel mais elevadas;

In [18]:
bairro_mean_alto = df_inmobiliaria.groupby(["Bairro"])["Valor"].mean().to_frame().sort_values("Valor").tail(5)
bairro_mean_alto.reset_index()

          Bairro          Valor
0    Cidade Nova   88166.692308
1  Vasco da Gama  120000.000000
2           Caju  120264.782609
3          Irajá  154610.470588
4    Jacarepaguá  314143.489637


4) Criar um gráfico de barras horizontais que apresente os 5 bairros com as médias de valores de aluguel mais elevadas.

In [22]:
plt.plot(kind='Barh', x=Bairro_mean_alto['Baorro